# CannotPasteCurtainGridLine Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CopyPasteFailures..::..CannotPasteCurtainGridLine Property
BuiltInFailures..::..CopyPasteFailures Class See Also
---
Can't paste Curtain Grid Line.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotPasteCurtainGridLine { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotPasteCurtainGridLine As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotPasteCurtainGridLine {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CopyPasteFailures Class
Autodesk.Revit.DB Namespace